enfieldcat/ESP32_miniThrottle/ESP32_miniThrottle.ino
/*
miniThrottle, A WiThrottle/DCC-Ex Throttle for model train control

MIT License

Copyright (c) [2021-2024] [Enfield Cat]

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/



/*
 * Reference Page: https://www.jmri.org/help/en/package/jmri/jmrit/withrottle/Protocol.shtml
 */
#include "miniThrottle.h"
#include "static_defs.h"

// Initialize the OLED display using i2c interface, Adjust according to display device
// DisplaySSD1306_128x64_I2C display(-1); // or (-1,{busId, addr, scl, sda, frequency})
#ifdef SSD1306
DisplaySSD1306_128x64_I2C display (-1,{0, DISPLAYADDR, SCK_PIN, SDA_PIN, (uint32_t) -1});
#endif
#ifdef SSD1327
DisplaySSD1327_128x128_I2C display (-1,{0, DISPLAYADDR, SCK_PIN, SDA_PIN, (uint32_t) -1});
#endif
#ifdef ST7735
// params {reset, {busid, cs, dc, freq, scl, sca}}
// reset may be -1 if not used, otherwise -1 => defaults
DisplayST7735_128x160x16_SPI display(SPI_RESET,{-1, SPI_CS, SPI_DC, 0, SPI_SCL, SPI_MOSI});
#endif
#ifdef ST7789
DisplayST7789_135x240x16_SPI display(SPI_RESET,{-1, SPI_CS, SPI_DC, 0, SPI_SCL, SPI_MOSI});
#endif
#ifdef ILI9341
DisplayILI9341_240x320x16_SPI display(SPI_RESET,{-1, SPI_CS, SPI_DC, 0, SPI_SCL, SPI_MOSI});
#endif

#ifdef USEWIFI
// WiFi Server Definitions
static WiFiClient client;                    // client to use for connection to CS
static WiFiClient diagServerClient[MAXDIAGCONNECT];
#endif
#ifdef SERIALCTRL
static HardwareSerial serial_dev(1);  // serial port to use when connection directly to DCC-Ex
#endif
static SemaphoreHandle_t nvsSem       = xSemaphoreCreateMutex();  // only one thread to access nvs at a time
static SemaphoreHandle_t serialSem    = xSemaphoreCreateMutex();  // only one thread to access serial to dcc-ex at a time
static SemaphoreHandle_t consoleSem   = xSemaphoreCreateMutex();  // only aalow one message to be written console at a time
static SemaphoreHandle_t velociSem    = xSemaphoreCreateMutex();  // used for velocity / direction changes table lock of locomotives
static SemaphoreHandle_t functionSem  = xSemaphoreCreateMutex();  // used for setting functions - table lock of all functions
static SemaphoreHandle_t turnoutSem   = xSemaphoreCreateMutex();  // used for setting turnouts  - table lock of all turnouts
static SemaphoreHandle_t routeSem     = xSemaphoreCreateMutex();  // used for setting routes    - table lock of all routes
// Normal TCP/IP operations work OK in single threaded environment, but benefits from semaphore protection in multi-threaded envs
// This does lead to kludges to keep operations such as available() outside if or while logic to maintain runtime stability.
static SemaphoreHandle_t tcpipSem     = xSemaphoreCreateMutex();
static SemaphoreHandle_t fastClockSem = xSemaphoreCreateMutex();  // for sending/receiving/displaying fc messages
static SemaphoreHandle_t shmSem       = xSemaphoreCreateMutex();  // shared memory for used for moved blocks of data between tasks/threads
#ifdef USEWIFI
static SemaphoreHandle_t diagPortSem  = xSemaphoreCreateMutex();  // try to only enqueue one message at a time
static SemaphoreHandle_t rescanSem    = xSemaphoreCreateMutex();  // only one scan of wifi networks at any time
#endif
static SemaphoreHandle_t procSem      = xSemaphoreCreateMutex();  // Process control Semaphore
#ifdef WEBLIFETIME
static SemaphoreHandle_t webServerSem = xSemaphoreCreateMutex();  // used by different web server threads
#endif
#ifdef BACKLIGHTPIN
static SemaphoreHandle_t screenSvrSem = xSemaphoreCreateMutex();  // used to coordinate screen/menu blanking
#endif
#ifdef RELAYPORT
static SemaphoreHandle_t relaySvrSem  = xSemaphoreCreateMutex();  // used by various relay threads to coordinate memory/dcc-ex access
#endif
#ifdef OTAUPDATE
#ifndef NOHTTPCLIENT
static SemaphoreHandle_t otaSem       = xSemaphoreCreateMutex();  // used to ensure only one ota activity at a time
static HTTPClient *otaHttp            = new HTTPClient();         // Client used for update
#endif
#endif
static QueueHandle_t cvQueue          = xQueueCreate (2,  sizeof(int16_t));  // Queue for querying CV Values
static QueueHandle_t keyboardQueue    = xQueueCreate (3,  sizeof(char));     // Queue for keyboard type of events
static QueueHandle_t keyReleaseQueue  = xQueueCreate (3,  sizeof(char));     // Queue for keyboard release type of events
static QueueHandle_t locoUpdateQueue  = xQueueCreate (3,  sizeof(char));     // Queue for signaling change required to loco driving display
static QueueHandle_t dccAckQueue      = xQueueCreate (10, sizeof(uint8_t));  // Queue for dcc updates, avoid flooding of WiFi
static QueueHandle_t dccLocoRefQueue  = xQueueCreate (10, sizeof(uint8_t));  // Queue for dcc locomotive speed and direction changes
static QueueHandle_t dccTurnoutQueue  = xQueueCreate (10, sizeof(uint8_t));  // Queue for dcc turnout data
static QueueHandle_t dccRouteQueue    = xQueueCreate (10, sizeof(uint8_t));  // Queue for dcc route data
static QueueHandle_t dccOffsetQueue   = xQueueCreate (10, sizeof(uint8_t));  // Queue for dcc array offsets for setup of data
#ifdef USEWIFI
static QueueHandle_t diagQueue        = xQueueCreate (256, sizeof(char));    // diagnostic data queue.
#endif
static struct locomotive_s   *locoRoster   = (struct locomotive_s*) malloc (sizeof(struct locomotive_s) * MAXCONSISTSIZE);
static struct turnoutState_s *turnoutState = NULL;  // table of turnout states
static struct turnout_s      *turnoutList  = NULL;  // table of turnouts
static struct routeState_s   *routeState   = NULL;  // table of route states
static struct route_s        *routeList    = NULL;  // table of routes
static char *sharedMemory = NULL;     // inter process communication shared memory buffer
const char *baseMenu[]  = { "Locomotives", "Turnouts", "Routes", "Track Power", "CV Programming", "Configuration" };
#ifdef BACKLIGHTPIN
#ifdef SCREENSAVER
static uint64_t screenActTime  = 0;   // time stamp of last user activity
static uint64_t blankingTime   = 0;   // min time prior to blanking
#endif
static uint16_t backlightValue = 200; // backlight brightness 0-255
#endif
#ifndef NODISPLAY
static int screenWidth      = 0;      // screen geometry in pixels
static int screenHeight     = 0;
#endif
static int keepAliveTime    = 10;     // WiThrottle keepalive time
#ifdef BRAKEPRESPIN
static int brakePres        = 0;      // brake pressure register
#endif
static uint32_t fc_time = 36;         // in jmri mode we can receive fast clock, in relay mode we can send it, 36s past midnight => not updated
static uint32_t flash_size = 0;
static float sharedRegister[REGISTERCOUNT];
static uint32_t defaultLatchVal     = 0;  // bit map of which functions latch
static uint32_t defaultLeadVal      = 0;  // bit map of which functions are for lead loco only
const  uint16_t routeDelay[]        = {0, 500, 1000, 2000, 3000, 4000}; // selectable delay times when setting route in DCCEX mode
static uint16_t numberOfNetworks    = 0;  // count of networks detected in scan of networks
static uint16_t initialLoco         = 3;  // lead loco register for in-throttle consists
static uint16_t *dccExNumList       = NULL;// List of numeric IDs returned by DCC-Ex when querying Ex-Rail
static uint8_t dccExNumListSize     = 0;  // size of the above array
static uint8_t locomotiveCount      = 0;  // count of defined locomotives
static uint8_t turnoutCount         = 0;  // count of defined turnouts
static uint8_t turnoutStateCount    = 0;  // count of defined turnout states
static uint8_t routeCount           = 0;  // count of defined routes
static uint8_t routeStateCount      = 0;  // count of defined route states
static uint8_t lastMainMenuOption   = 0;  // track last selected option in main menu
static uint8_t lastLocoMenuOption   = 0;  // track last selected option in locomotive menu
static uint8_t lastSwitchMenuOption = 0;  // track last selected option in switch/turnout menu
static uint8_t lastRouteMenuOption  = 0;  // track last selected option in route menu
static uint8_t debuglevel           = DEBUGLEVEL;
static uint8_t charsPerLine;              // using selected font the number chars across display
static uint8_t linesPerScreen;            // using selected font the number lines on display
static uint8_t debounceTime = DEBOUNCEMS; // debounce time to allow on mechanical (electric) switches
static uint8_t cmdProtocol  = UNDEFINED;  // protocol to use when running this unit
static uint8_t nextThrottle = 'A';        // use as throttle "number" in WiThrottle protocol
static uint8_t screenRotate = 0;          // local display orientation
static uint8_t dccPowerFunc = DCCPOWER;   // variant of power on to use for DCC power on
static uint8_t coreCount    = 2;          // cpu core count, used for some diagnostics
static uint8_t inventoryLoco = LOCALINV;  // default to local inventory for locos
static uint8_t inventoryTurn = LOCALINV;  // default tp local inventory for turnouts
static uint8_t inventoryRout = LOCALINV;  // default to local inventory for routes / automations
#ifdef RELAYPORT
static WiFiServer *relayServer;                  // the relay server wifi service
struct relayConnection_s *remoteSys = NULL;      // table of connected clients and assoc states
static uint64_t maxRelayTimeOut = ((KEEPALIVETIMEOUT * 2) + 1 ) * uS_TO_S_FACTOR;
static uint32_t localinPkts     = 0;             // packet count over serial connection
static uint32_t localoutPkts    = 0;             // packet count over serial connection
static uint16_t relayPort       = RELAYPORT;     // tcp/ip relay listening port number
static uint8_t maxRelay         = MAXRELAY;      // max number of relay clients
static uint8_t relayMode        = WITHROTRELAY;  // protocol to relay
static uint8_t relayCount       = 0;
static uint8_t relayClientCount = 0;
static uint8_t maxRelayCount    = 0;             // high water mark
// When relaying we can also supply fast clock time
static float fc_multiplier      = 0.00;          // multiplier of elapsed real time to scale time
static bool fc_restart          = false;         // restart fast clock service?
static bool startRelay          = true;          // restart relay service?
static uint8_t defaultWifiMode  = WIFIBOTH;      // default wifi mode
#else
static uint8_t defaultWifiMode  = WIFIBOTH;      // default wifi mode - Optionally change to WIFISTA as non-relay default
#endif
#ifndef SERIALCTRL
static uint64_t maxKeepAliveTO  = 0;             // by default ignore keep alive replies
#endif
#ifdef WEBLIFETIME
static WiFiServer *webServer;                    // the web server wifi service
static uint16_t webPort         = WEBPORT;       // tcp/ip web server port
static int8_t webServerCount    = 0;             // sever serial number
static int8_t webClientCount    = 0;             // count of open connection
static int8_t maxWebClientCount = 0;             // high water mark
static char webCredential[64] = { "" };          // http basic auth string
static bool webIsRunning      = true;            // running state, used to set termination on inactivity
static bool startWeb          = true;            // restart web server
#endif
static char ssid[SSIDLENGTH];            // SSID connected to in STA mode
static char tname[SSIDLENGTH];           // name of this throttle/relay
static char remServerType[10] = { "" };  // eg: JMRI
static char remServerDesc[64] = { "" };  // eg: JMRI My whizzbang server v 1.0.4
static char remServerNode[32] = { "" };  // eg: 192.168.6.1
static char lastMessage[40]   = { "" };  // eg: JMRI: address 'L23' not allowed as Long
static char dccLCD[4][21];               // DCC-Ex LCD messages
static char diagMonitorMode   = ' ';     // mode of diag monitor
static bool configHasChanged  = false;
static bool showPackets       = false;   // debug setting: [no]showpackets
static bool showNextPacket    = false;   // Show next packet - used for sendcmd responses
static bool showKeepAlive     = false;   // debug setting: [no]showkeepalive
static bool showKeypad        = false;   // debug setting: [no]showkeypad
static bool showWebHeaders    = false;   // debug setting: [no]showweb
static bool trackPower        = false;   // track power status on/off
static bool refreshDisplay    = true;    // display requires refresh in loco driving mode
static bool drivingLoco       = false;   // Are we driving anything
static bool initialDataSent   = false;   // Has a request been sent to CS for initial data
static bool bidirectionalMode = false;   // Are we running in bidirectional mode?
static bool menuMode          = false;   // in menu mode - screen savable mode, differrent keypad maps
static bool funcChange        = true;    // in locomotive driving mode, have functions changed?
static bool speedChange       = false;   // in locomotive driving mode, has speed changed?
static bool netReceiveOK      = false;
static bool diagReceiveOK     = false;   // flag to ensure only one cpy is running
static bool usePSRAM          = false;   // Should we use PSRAM
#ifdef USEWIFI
static bool diagIsRunning     = false;   // run state indicator
static bool obsessive         = false;   // obsessive connectivity checks
#endif
static bool APrunning         = false;   // are we running as an access point?
static bool wiCliConnected    = false;   // manage our own wifi client connected state
static bool inConfigMenu      = false;   // in config menu flag - config menu can run without server connection
static bool resetKeepAliveInd = false;   // is the keep alive timer reset if other oackets are sent?
#ifdef USEWIFI
static WiFiServer *diagServer = NULL;    // the diagnostic server wifi service
#endif
#ifdef POTTHROTPIN
static bool enablePot         = true;    // potentiometer enable/disable while driving
#endif
#ifdef SCREENSAVER
static bool inScreenSaver     = false;   // Has backlight been turned off?
#endif
// Automation related
static struct procTable_s    procTable[PROCTABLESIZE];
static struct dccSensor_s    dccSensorTable[DCCSENSORCNT];	
static struct localpin_s     localPinTable[LOCALPINCNT];
static int8_t ledChannel     = 0;
#ifdef FILESUPPORT
static fs::File writeFile;
static bool writingFile       = false;
const  char* rootCACertificate= NULL;
#ifdef CERTFILE
const  char* defaultCertificate = \
"-----BEGIN CERTIFICATE-----\n" \
"MIIFFjCCAv6gAwIBAgIRAJErCErPDBinU/bWLiWnX1owDQYJKoZIhvcNAQELBQAw\n" \
"TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh\n" \
"cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMjAwOTA0MDAwMDAw\n" \
"WhcNMjUwOTE1MTYwMDAwWjAyMQswCQYDVQQGEwJVUzEWMBQGA1UEChMNTGV0J3Mg\n" \
"RW5jcnlwdDELMAkGA1UEAxMCUjMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK\n" \
"AoIBAQC7AhUozPaglNMPEuyNVZLD+ILxmaZ6QoinXSaqtSu5xUyxr45r+XXIo9cP\n" \
"R5QUVTVXjJ6oojkZ9YI8QqlObvU7wy7bjcCwXPNZOOftz2nwWgsbvsCUJCWH+jdx\n" \
"sxPnHKzhm+/b5DtFUkWWqcFTzjTIUu61ru2P3mBw4qVUq7ZtDpelQDRrK9O8Zutm\n" \
"NHz6a4uPVymZ+DAXXbpyb/uBxa3Shlg9F8fnCbvxK/eG3MHacV3URuPMrSXBiLxg\n" \
"Z3Vms/EY96Jc5lP/Ooi2R6X/ExjqmAl3P51T+c8B5fWmcBcUr2Ok/5mzk53cU6cG\n" \
"/kiFHaFpriV1uxPMUgP17VGhi9sVAgMBAAGjggEIMIIBBDAOBgNVHQ8BAf8EBAMC\n" \
"AYYwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMBIGA1UdEwEB/wQIMAYB\n" \
"Af8CAQAwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYfr52LFMLGMB8GA1UdIwQYMBaA\n" \
"FHm0WeZ7tuXkAXOACIjIGlj26ZtuMDIGCCsGAQUFBwEBBCYwJDAiBggrBgEFBQcw\n" \
"AoYWaHR0cDovL3gxLmkubGVuY3Iub3JnLzAnBgNVHR8EIDAeMBygGqAYhhZodHRw\n" \
"Oi8veDEuYy5sZW5jci5vcmcvMCIGA1UdIAQbMBkwCAYGZ4EMAQIBMA0GCysGAQQB\n" \
"gt8TAQEBMA0GCSqGSIb3DQEBCwUAA4ICAQCFyk5HPqP3hUSFvNVneLKYY611TR6W\n" \
"PTNlclQtgaDqw+34IL9fzLdwALduO/ZelN7kIJ+m74uyA+eitRY8kc607TkC53wl\n" \
"ikfmZW4/RvTZ8M6UK+5UzhK8jCdLuMGYL6KvzXGRSgi3yLgjewQtCPkIVz6D2QQz\n" \
"CkcheAmCJ8MqyJu5zlzyZMjAvnnAT45tRAxekrsu94sQ4egdRCnbWSDtY7kh+BIm\n" \
"lJNXoB1lBMEKIq4QDUOXoRgffuDghje1WrG9ML+Hbisq/yFOGwXD9RiX8F6sw6W4\n" \
"avAuvDszue5L3sz85K+EC4Y/wFVDNvZo4TYXao6Z0f+lQKc0t8DQYzk1OXVu8rp2\n" \
"yJMC6alLbBfODALZvYH7n7do1AZls4I9d1P4jnkDrQoxB3UqQ9hVl3LEKQ73xF1O\n" \
"yK5GhDDX8oVfGKF5u+decIsH4YaTw7mP3GFxJSqv3+0lUFJoi5Lc5da149p90Ids\n" \
"hCExroL1+7mryIkXPeFM5TgO9r0rvZaBFOvV2z0gp35Z0+L4WPlbuEjN/lxPFin+\n" \
"HlUjr8gRsI3qfJOQFy/9rKIJR0Y/8Omwt/8oTWgy1mdeHmmjk7j1nYsvC9JSQ6Zv\n" \
"MldlTTKB3zhThV1+XWYp6rjd5JW1zbVWEkLNxE7GJThEUG3szgBVGP7pSWTUTsqX\n" \
"nLRbwHOoq7hHwg==\n" \
"-----END CERTIFICATE-----\n" ;
#endif  //  CERTFILE
#ifdef WEBLIFETIME
const char *cssTemplate = {"* { font-family: system-ui; }\n" \
"html { text-align: left; }\n" \
"body { max-width: 800px; margin: 5px; background-color: #FFFFEE; }\n" \
"hr { border-top: 1px dashed blue; }\n" \
"pre { background-color: #000000; color: #88FF88; }\n" \
"table { border 0; }\n" \
"tr:nth-child(even) { background-color: #DDDDDD; }\n" \
"h1 { color: #0000DD; }\n" \
"h2, h3, h4, th { background-color: #0000DD; color: #FFFFFF; }\n" \
"textarea { font-family: \"Lucida Console\", \"Courier New\", monospace; }\n" \
"a:link { color: #0000DD !important; outline: none !important; }\n" \
"a:visited { color: #0000DD !important; }\n" \
"a:hover { background-color: #0000DD !important; color: #FFFFFF !important; text-decoration: none; }\n" \
"a:active { color: #0000DD !important; }\n" \
".Active, .active, .thrown, .Thrown { background-color: #CCFFCC !important; }\n" \
".Inactive, .inactive, .closed, .Closed { background-color: #CCCCFF !important; }\n" \
".unknown, .Unknown .Inconsistent { background-color: #FFCCCC !important; }\n" \
".failed, .Failed { background-color: #CC0000 !important; color: #FFFFFF !important; }\n" \
".speed, .On { background-color: #008800 !important; padding: 0px; border-spacing: 0px; }\n" \
".space { background-color: #FFFFEE !important; padding: 0px; border-spacing: 0px; }\n" \
".Off { background-color: #DD0000 !important; padding: 0px; border-spacing: 0px; }\n" \
};
