enfieldcat/ESP32_miniThrottle/ESP32_miniThrottle.ino
#endif  //  WEBLIFETIME
const char *sampleAuto = {"# Sample automation of power and keypad tasks\n" \
"# use for repetative testing and system set up\n# Rename as /auto.run to run automatically on start.\n#\n" \
"# delete exit line to allow rest of automation to run\nexit\n#\n" \
"# wait for connection and power on\nwaitfor connected\nrem connected proceeding with automation.\ndelay 1000\npower on\nwaitfor trackpower\n#\n" \
"# Now set up initial route\nroute initial\ndelay 5000\n#\n" \
"# Do some keypad setup\nkey L\ndelay 1000\nkey U\ndelay 500\nkey U\ndelay 500\nkey U\n" \
};
const char *sampleConfig = {"# Sample file for adding definitions to miniThrottle\n" \
"#\nTypically this may be used to define a locomotive roster and turnouts for\n" \
"# DCC-Ex or set configuration parameters which can be set at the console.\n\n" \
"# Comment lines start with a \"#\"\n" \
"# Suggestions:\n" \
"#  1. be consistent with names starting with either Capitals or lowercase.\n" \
"#  2. max route length is 20 turnouts per route\n" \
"#\n" \
"# add loco <dcc-address> <description>\n" \
"# add turnout <name> {DCC|SERVO|VPIN} <dcc-definition>\n" \
"# add route <name> {<turnout-name> <state>} {<turnout-name> <state>}...\n" \
"#    Add a locomotive, turnout or route to DCC-Ex roster\n" \
"#    where for turnouts, definitions may be:\n" \
"#       DCC <linear-address>\n" \
"#       DCC <address> <sub-address>\n" \
"#       SERVO <pin> <throw-posn> <closed-posn> <profile>\n" \
"#       VPIN <pin-number>\n" \
"#    Servo profile: 0=immediate, 1=0.5 secs, 2=1 sec, 3=2 secs, 4=bounce\n" \
"#    And where for routes, turn-out state is one of:\n" \
"#       C - Closed\n" \
"#       T - Thrown\n" \
"#\n" \
"# del {loco|turnout|route} <dcc-address|name>\n" \
"#    Delete a locomotive or turnout from DCC-Ex roster\n" \
"#\n" \
"add loco 3 factory default loco\n" \
"add turnout riverRd01 SERVO 101 132 198 2\n" \
"add turnout riverRd02 SERVO 102 132 198 2\n" \
"add route platform-1 riverRd01 T riverRd02 T\n" \
"add route platform-2 riverRd01 C riverRd02 C\n" \
"del loco 7\n" \
"cpuspeed 240\n" \
"name trainCtrl\n" \
"wifi 3 BrocolliSoup PepperCorns123\n" \
"restart\n" \
};
const char *sampleCommand = { "# Sample file showing running of a command to start diag port\n" \
"diag\n\n" \
};
#endif  //  FILESUPPORT

const char prevMenuOption[] = { "Prev. Menu"};
const char *protoList[]     = { "Undefined", "WiThrottle", "DCC-Ex" };
#ifdef RELAYPORT
const char *relayTypeList[]  = { "None", "WiThrottle", "DCC-Ex"};
#endif

// selected font sizes being:
static uint8_t selFontWidth  = 8;
static uint8_t selFontHeight = 16;

const char txtWarning[] = { "Warning" };


/*
 * Set up steps
 * * Initialise console connection
 * * Load basic config
 * * Start subtasks to handle I/O
 */
void setup()  {
  // esp_chip_info_t chip_info;
  char commandKey = '.';
  bool cpuOK = true;
  Serial.begin(115200);
  #ifdef STARTDELAY
    Serial.printf ("Waiting %d seconds:", STARTDELAY);
    for (uint8_t n=0; n<STARTDELAY; n++) {
      Serial.printf (" #");
      delay (1000);
    }
    Serial.printf (" Starting\r\n");
  #endif
  for (uint8_t n=0; n<MAXCONSISTSIZE; n++) {
    strcpy (locoRoster[n].name, "Void");
    locoRoster[n].owned          = false;
    locoRoster[n].relayIdx       = 255;
    locoRoster[n].reverseConsist = false;
  }
  // load initial settings from Non Volatile Storage (NVS)
  nvs_init();
  nvs_get_string ("tname", tname, NAME, sizeof(tname));
  // Print a diagnostic to the console, Prior to starting tasks no semaphore required
  //esp_chip_info(&chip_info);
  coreCount = ESP.getChipCores();
  #ifdef ESP_ARDUINO_VERSION_MAJOR
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // Code for version 3.x
    esp_flash_get_size(NULL, &flash_size);
  #else
    // Code for version 2.x
    flash_size = spi_flash_get_chip_size();
  #endif
  #else
    // Code for version 1.x
    flash_size = spi_flash_get_chip_size();
  #endif
  flash_size = flash_size / ( 1024 *1024);

  mt_ruler (NULL);
  #if ESPMODEL == ESP32C3
  printf  ("Hardware Vers: %d core %s (rev %d) %dMHz, Xtal: %dMHz, %d MB flash\r\n", \
     coreCount, \
     ESP.getChipModel(), \
     ESP.getChipRevision(), \
     ESP.getCpuFreqMHz(), \
     getXtalFrequencyMhz(), \
     flash_size);
  printf ("  Heap Memory: %d bytes\r\n", ESP.getHeapSize());
  printf ("Console Tx and Rx ports switch to I/O pins %d and %d respectively\r\n", TX, RX);
  #else    // ESP32C3
  Serial.printf  ("Hardware Vers: %d core %s (rev %d) %dMHz, Xtal: %dMHz, %d MB flash\r\n", \
     coreCount, \
     ESP.getChipModel(), \
     ESP.getChipRevision(), \
     ESP.getCpuFreqMHz(), \
     getXtalFrequencyMhz(), \
     flash_size);
  Serial.printf  ("  Heap Memory: %d bytes\r\n", ESP.getHeapSize());
  #endif    // ESP32C3
  Serial.printf  ("Software Vers: %s %s\r\n", PRODUCTNAME, VERSION);
  Serial.printf  (" Compile Time: %s %s\r\n", __DATE__, __TIME__);
  #ifndef NODISPLAY
  Serial.printf  (" Display Type: %s\r\n", DISPLAYNAME);
  #else
  Serial.printf  (" Display Type: No Display\r\n");
  #endif   //  NODISPLAY
  Serial.printf  ("Throttle Name: %s\r\n", tname);
  // Optional define in miniThrottle.h, not critical to check partitions on each reboot
  mt_ruler (NULL);
  for (uint8_t n=0; n<coreCount; n++) print_reset_reason(n, rtc_get_reset_reason(n));
  mt_ruler (NULL);
  if (nvs_get_int ("bidirectional", 0) == 1) bidirectionalMode = true;
  #if ESPMODEL == ESP32
  if (strcmp (ESP.getChipModel(), "ESP32") != 0 && strncmp (ESP.getChipModel(), "ESP32-D", 7) != 0) cpuOK = false;
  #elif ESPMODEL == ESP32S2
  if (strcmp (ESP.getChipModel(), "ESP32-S2") != 0) cpuOK = false;
  #elif ESPMODEL == ESP32S3
  if (strcmp (ESP.getChipModel(), "ESP32-S3") != 0) cpuOK = false;
  #elif ESPMODEL == ESP32C2
  if (strcmp (ESP.getChipModel(), "ESP32-C2") != 0) cpuOK = false;
  #elif ESPMODEL == ESP32C2
  if (strcmp (ESP.getChipModel(), "ESP32-C3") != 0) cpuOK = false;
  #elif ESPMODEL == ESP32C5
  if (strcmp (ESP.getChipModel(), "ESP32-C5") != 0) cpuOK = false;
  #elif ESPMODEL == ESP32C6
  if (strcmp (ESP.getChipModel(), "ESP32-C6") != 0) cpuOK = false;
  #endif
  if (!cpuOK) {
    char* cpuName = (char*) ESP.getChipModel();
    Serial.printf ("CPU type mismatch, requires miniThrottle.h line: #define ESPMODEL ");
    if      (strcmp (cpuName, "ESP32")    == 0 || strncmp (ESP.getChipModel(), "ESP32-D", 7) == 0) Serial.printf ("ESP32");
    else if (strcmp (cpuName, "ESP32-S2") == 0) Serial.printf ("ESP32S2");
    else if (strcmp (cpuName, "ESP32-S3") == 0) Serial.printf ("ESP32S3");
    else if (strcmp (cpuName, "ESP32-C2") == 0) Serial.printf ("ESP32C2");
    else if (strcmp (cpuName, "ESP32-C5") == 0) Serial.printf ("ESP32C5");
    else if (strcmp (cpuName, "ESP32-C6") == 0) Serial.printf ("ESP32C6");
    else if (strcmp (cpuName, "ESP32-C3") == 0) Serial.printf ("ESP32C3");
    else                                        Serial.printf ("ESP32");
    Serial.printf ("\r\nInitialisation halted, please define and recompile.\r\n");
    while (true) delay (10000);
  }
  #ifdef SHOWPARTITIONS
  displayPartitions();
  #endif    // SHOWPARTITIONS
  if (showPinConfig()) Serial.printf ("%s Basic hardware check passed.\r\n", getTimeStamp());
  else {
    Serial.printf ("%s Basic hardware check failed.\r\n", getTimeStamp());
    Serial.printf ("%s Some I/O pins may have more than one assignment.\r\n", getTimeStamp());
    Serial.printf ("%s Reconfigure and recompile required to proceed.\r\n", getTimeStamp());
    Serial.printf ("%s System initialisation halted.\r\n", getTimeStamp());
    while (true) delay (10000);
  }
  #ifdef SHOWPACKETSONSTART
  showPackets = true;
  #endif    //  SHOWPACKETSONSTART
  debounceTime = nvs_get_int ("debounceTime", DEBOUNCEMS);
  screenRotate = nvs_get_int ("screenRotate", 0);
  // Also change CPU speed before starting wireless comms
  #ifndef NOCPUSPEED
  {
    int cpuSpeed = nvs_get_int ("cpuspeed", 0);
    if (cpuSpeed > 0) {
      #ifdef USEWIFI   //  USEWIFI
      if (cpuSpeed < 80) cpuSpeed = 80; 
      #endif
      Serial.printf ("%s Setting CPU speed to %d MHz\r\n", getTimeStamp(), cpuSpeed);
      delay (1000);
      setCpuFrequencyMhz (cpuSpeed);
      delay (1000);
    }
  }
  #endif
  if (psramInit()) {
    Serial.printf("%s PSRAM initialized: %dMb\r\n", getTimeStamp(), ((int)(ESP.getPsramSize() / (1024*1024))));
    if (nvs_get_int ("usePSRAM", 1) > 0) usePSRAM = true;
  } else {
    Serial.printf("%s PSRAM not available\r\n", getTimeStamp());
  }
  debuglevel      = nvs_get_int ("debuglevel",    DEBUGLEVEL);
  dccPowerFunc    = nvs_get_int ("dccPower",      DCCPOWER);
  defaultLatchVal = nvs_get_int ("FLatchDefault", FUNCTLATCH);
  defaultLeadVal  = nvs_get_int ("FLeadDefault",  FUNCTLEADONLY);
  inventoryLoco   = nvs_get_int ("inventoryLoco", LOCALINV);
  inventoryTurn   = nvs_get_int ("inventoryTurn", LOCALINV);
  inventoryRout   = nvs_get_int ("inventoryRout", LOCALINV);
  for (uint8_t n=0;n<4;n++) dccLCD[n][0] = '\0'; // store empty string in dccLCD array
  // initialise queues
  commandKey = '.'; // initialise queue to start
  xQueueSend (keyboardQueue, &commandKey, 0);
  xQueueSend (keyReleaseQueue, &commandKey, 0);
  // xQueueSend (locoUpdateQueue, &commandKey, 0);
  xQueueSend (dccAckQueue, &commandKey, 0);
  #ifdef RELAYPORT
  relayPort = nvs_get_int ("relayPort", RELAYPORT);
  relayServer = new WiFiServer(relayPort);
  maxRelay = nvs_get_int ("maxRelay", MAXRELAY);
  if (maxRelay>MAXRELAY)  maxRelay = MAXRELAY;  // MAXRELAY is the absolute max number of connections we want to support
  relayMode = nvs_get_int ("relayMode", WITHROTRELAY);
  maxRelayTimeOut =  ((nvs_get_int ("relayKeepAlive", KEEPALIVETIMEOUT) * 2) + 1) * uS_TO_S_FACTOR;
  if (debuglevel>0 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    const char *relType[] = { "None", "WiThrottle", "DCC-Ex" };
    Serial.printf ("%s Relay type is: %s, port %d, max clients %d\r\n", getTimeStamp(), relType[relayMode], relayPort, maxRelay);
    xSemaphoreGive(consoleSem);
  }
  #endif    //  RELAYPORT
  // Configure I/O pins
  // Track power indicator
  #ifdef TRACKPWR
  pinMode(TRACKPWR, OUTPUT);
  digitalWrite(TRACKPWR, LOW);
  #else
  #ifdef TRACKPWRINV
  pinMode(TRACKPWRINV, OUTPUT);
  digitalWrite(TRACKPWRINV, HIGH);
  #endif   //  TRACKPWRINV
  #endif   //  TRACKPWR
  // function key indicators off
  #ifdef F1LED
  pinMode(F1LED, OUTPUT);
  digitalWrite(F1LED, LOW);
  #endif   //  F1LED
  #ifdef F2LED
  pinMode(F2LED, OUTPUT);
  digitalWrite(F2LED, LOW);
  #endif   //  F2LED
  // trainset mode indicator
  #ifdef TRAINSETLED
  pinMode(TRAINSETLED, OUTPUT);
  if (bidirectionalMode) digitalWrite(TRAINSETLED, HIGH);
  else digitalWrite(TRAINSETLED, LOW);
  #endif   // TRAINSETLED
  // Read a backlight reference ADC pin and set backlight PWM using this
  #ifdef BACKLIGHTPIN
  pinMode(BACKLIGHTPIN, OUTPUT);
  #ifdef BACKLIGHTREF
  analogReadResolution(10);
  adcAttachPin(BACKLIGHTREF);
  analogSetPinAttenuation(BACKLIGHTREF, ADC_11db);  // param 2 = attenuation, range 0-3 sets FSD: 0:ADC_0db=800mV, 1:ADC_2_5db=1.1V, 2:ADC_6db=1.35V, 3:ADC_11db=2.6V
  backlightValue = (analogRead(BACKLIGHTREF))>>2;
  #else
  // digitalWrite (BACKLIGHTPIN, 1);
  backlightValue = nvs_get_int ("backlightValue", 200);
  #endif    //  BACKLIGHTREF
  #ifdef ESP_ARDUINO_VERSION_MAJOR
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // Code for version 3.x
    // Attach the pin, frequency (5000 Hz), and resolution (8 bits) in one call
    ledcAttach(BACKLIGHTPIN, 5000, 8);
    // Write the PWM duty cycle directly using the pin number
    ledcWrite(BACKLIGHTPIN, backlightValue);
  #else
    // Code for version 2.x
    ledcSetup(0, 5000, 8);
    ledcAttachPin(BACKLIGHTPIN, 0);
    ledcWrite(0, backlightValue);
  #endif
  #else
    // Code for version 1.x
    ledcSetup(0, 5000, 8);
    ledcAttachPin(BACKLIGHTPIN, 0);
    ledcWrite(0, backlightValue);
  #endif

  // analogWrite(BACKLIGHTPIN, backlightValue);
  #endif    //  BACKIGHTPIN
  // Set speedometer initial position
  #ifdef SPEEDOPIN
  dacWrite (SPEEDOPIN, 0);
  #endif   //  SPEEDOPIN
  // Set brake initial position
  #ifdef BRAKEPRESPIN
  dacWrite (BRAKEPRESPIN, 0);
  #endif   //  BRAKEPRESPIN

  // Check filesystem for config, cert and icon storage
  #ifdef FILESUPPORT
  Serial.printf ("%s Attaching SPIFFS filesystem.\r\n", getTimeStamp());
  if(SPIFFS.begin (false)) {
    Serial.printf ("%s SPIFFS filesystem started OK.\r\n", getTimeStamp());
    }
  else {
    Serial.printf ("%s SPIFFS filesystem formatting - please wait.\r\n", getTimeStamp());
    SPIFFS.begin (true);
    Serial.printf ("%s SPIFFS filesystem formatted OK.\r\n", getTimeStamp());
  }
  delay (250);
  sampleConfigExists(SPIFFS);
  #if defined(CERTFILE) && defined(WEBLIFETIME)
  defaultCertExists(SPIFFS);
  #endif   //  CERTFILE
  #ifdef WEBLIFETIME
  webPort = nvs_get_int ("webPort", WEBPORT);
  webServer = new WiFiServer(webPort);
  defaultCssFileExists(SPIFFS);
  #endif   //  WEBLIFETIME
  #endif   //  FILESUPPORT
  // Process management for automations
  for (uint8_t n=0; n<PROCTABLESIZE; n++) {
    procTable[n].id = 0;
    procTable[n].state = 11;
    for (uint8_t j=0; j<PROCNAMELENGTH; j++) procTable[n].filename[j] = '\0';
    }
  for (uint8_t i; i<REGISTERCOUNT; i++) sharedRegister[i] = 0.00;
  for (uint8_t i; i<DCCSENSORCNT;  i++) {
    dccSensorTable[i].id = 65500;
    dccSensorTable[i].value = SENSORUNKNOWN;
  }
  for (uint8_t i; i<LOCALPINCNT;   i++) {
    localPinTable[i].pinNr = 255;
    localPinTable[i].assignment = PWM + 10;
  }
  // Use tasks to process various input and output streams
  // micro controller has enough memory, that stack sizes can be generously allocated to avoid stack overflows
  xTaskCreate(serialConsole, "serialConsole", 8192, NULL, 4, NULL);
  delay (250);
  #ifdef SERIALCTRL
  cmdProtocol = DCCEX;    // expect it always to be this!
  #else
  cmdProtocol = nvs_get_int ("defaultProto", WITHROT);
  if (cmdProtocol == WITHROT) {
    resetKeepAliveInd = nvs_get_int("resetKeepAlive", 0) > 0;
  }
  #endif  //  SERIALCTRL
  #ifdef DELAYONSTART
  {
    uint16_t delayOnStart = nvs_get_int ("delayOnStart", DELAYONSTART);
    if (delayOnStart>120) delayOnStart = 120;
    if (delayOnStart > 0 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("%s Waiting %d seconds before starting network services and initialising display.\r\n", getTimeStamp(), delayOnStart);
      Serial.printf ("%s Count down: ", getTimeStamp());
      for (uint8_t n=0; n<delayOnStart; n++) {
        Serial.printf (" #");
        delay (1000);
      }
      printf (" Starting\r\n");
      xSemaphoreGive(consoleSem);
    }
  }
  #endif   // DELAYONSTART
  #ifdef USEWIFI
  if (nvs_get_int ("obsessive", 0) == 1) obsessive = true;
  else obsessive = false;
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s Starting WiFi network services\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  xTaskCreate(connectionManager, "connectionMgr", 6144, NULL, 4, NULL);
  #ifndef SERIALCTRL
  // Only used if connection to controlstation is over WiFi
  xTaskCreate(keepAlive, "keepAlive", 2048, NULL, 4, NULL);
  #endif   //  SERIALCTRL
  #endif   //  USEWIFI
  #ifdef SERIALCTRL
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s Starting connection to serially connected DCC-Ex\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  xTaskCreate(serialConnectionManager, "serialCntMgr", 6144, NULL, 4, NULL);
  #ifdef RELAYPORT
  #ifdef USEWIFI
  // if (relayMode == WITHROTRELAY) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("%s Starting fast clock server\r\n", getTimeStamp());
      xSemaphoreGive(consoleSem);
    }
    xTaskCreate(fastClock, "fastClock", 2048, NULL, 4, NULL);
  // }
  #endif  //  USEWIFI
  #endif  //  RELAYPORT
  #endif  //  SERIALCTRL
  #ifndef NODISPLAY
  #ifdef SCREENSAVER
  if (xSemaphoreTake(screenSvrSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    blankingTime  = nvs_get_int ("screenSaver", SCREENSAVER) * 60 * uS_TO_S_FACTOR;
    screenActTime = esp_timer_get_time();
    xSemaphoreGive(screenSvrSem);
    if (debuglevel>1 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("SCREEN: Blanking time %d S\r\n", (nvs_get_int ("screenSaver", SCREENSAVER) * 60));
      xSemaphoreGive(consoleSem);
    }
  }
  else semFailed ("screenSvrSem", __FILE__, __LINE__);
  #endif   // SCREENSAVER
  #ifdef keynone
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s No keypad defined\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  #else
  xTaskCreate(keypadMonitor, "keypadMonitor", 2048, NULL, 4, NULL);
  #endif   // keynone
  xTaskCreate(switchMonitor, "switchMonitor", 2048, NULL, 4, NULL);
  #endif   // NODISPLAY
  // Finally check for an auto run
  #ifdef FILESUPPORT
  if(SPIFFS.exists("/auto.run")) {
    runInitialAuto();
  }
  #endif
}

