enfieldcat/ESP32_miniThrottle/ESP32_miniThrottle.ino
/*
 * Main loop is used to run display
 * To avoid a corrupted display only update the display from a single thread
 * Try to avoid writing over the edge of the screen.
 */
void loop()
{
  #ifndef NODISPLAY
  uint8_t menuId = 0;
  uint8_t change = 0;
  uint8_t answer;
  uint8_t menuResponse[] = {1,2,3,4,5,6};
  uint8_t menuMask = nvs_get_int("mainMenuMask", 0);
  char commandKey;
  char commandStr[2];
  const char txtNoPower[] = { "Track power off. Turn power on to enable function." };
  bool menuDisplayable = false;
  #endif   // NODISPLAY

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s loop()\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  delay (250);
  #ifdef NODISPLAY
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s No display device\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  #else
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s Start device display (", getTimeStamp());
    #ifdef DISPLAYNAME
    Serial.print (DISPLAYNAME);
    Serial.print (", ");
    #endif
    #ifdef SCREENROTATE
    Serial.print (SCREENROTATE);
    Serial.print (" way rotatable, ");
    #endif
    #ifdef SCALEFONT
    Serial.print ("scalable speed indic, ");
    #endif
    #ifdef COLORDISPLAY
    Serial.println ("color)");
    #else
    Serial.println ("monochrome)");
    #endif
    xSemaphoreGive(consoleSem);
  }
  display.begin();
  setupFonts();

  while (xQueueReceive(keyboardQueue, &commandKey, pdMS_TO_TICKS(debounceTime)) == pdPASS) {} // clear keyboard buffer
  // No keypad or encoder => not locally controllable, so no menu just show info
  #ifndef ENCODE_UP
  #ifdef keynone
  while (true) {
    displayInfo();
    delay (20000);     // 20 second timeout
  }
  #endif
  #endif
  // Normal control
  while (true) {
    #ifndef SERIALCTRL
    if (!wiCliConnected) {
      uint8_t answer;
      static bool stateChange   = true;
      static bool wifiConnected = false;
      static bool APConnected   = false;

      if (((!APrunning) && WiFi.status() != WL_CONNECTED || !wiCliConnected) && xQueueReceive(keyboardQueue, &commandKey, pdMS_TO_TICKS(debounceTime)) == pdPASS) {
        mkConfigMenu();
        stateChange = true;
      }
      if (((!APrunning) && WiFi.status() != WL_CONNECTED) || (!wiCliConnected)) {
        if (wifiConnected && WiFi.status() != WL_CONNECTED) {
          wifiConnected = false;
          stateChange   = true;
        }
        else if ((!wifiConnected) && WiFi.status() == WL_CONNECTED) {
          wifiConnected = true;
          stateChange   = true;
        }
        if (APrunning && !APConnected) { //Access-point just started?
          APConnected = true;
          stateChange = true;
        }
        if (stateChange) {  // Update display if there is something to update
          uint8_t lineNr = 0;
          char outData[SSIDLENGTH + 10];
          stateChange = false;
          display.clear();
          displayScreenLine ("No Connection", lineNr++, true);
          sprintf (outData, "Name: %s", tname);
          displayScreenLine (outData, lineNr++, false);
          if ((!APrunning) && WiFi.status() == WL_CONNECTED) {
            if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
              uint8_t waitLoop = 0;
              while (strlen (ssid) == 0 && waitLoop++ < 100) {
                xSemaphoreGive(tcpipSem);
                delay (100);
                xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10));
              }
              xSemaphoreGive(tcpipSem);
            }
            else semFailed ("tcpipSem", __FILE__, __LINE__);
          }
          if (APrunning || WiFi.status() == WL_CONNECTED) {
            if (APrunning) {
              displayScreenLine ("WiFi: AP Mode", lineNr++, false);
            }
            else if (WiFi.status() == WL_CONNECTED && strlen(ssid)>0) {
              sprintf (outData, "WiFi: %s", ssid);
              displayScreenLine (outData, lineNr++, false);
            }
            displayScreenLine ("Svr:  Connecting", lineNr++, false);
          }
          else {
            displayScreenLine ("Wifi: Connecting", lineNr++, false);
          }
        }
      }
    }
    else {
      while (wiCliConnected) {
    #else   // SERIALCTRL
    // handling for Serial connection
    if (true) {
      while (true) { // Assume serial => always connected
    #endif  // SERIALCTRL
        // Prime the menuResponse as if it will all work
        for (uint8_t n=0; n<sizeof(menuResponse); n++) menuResponse[n] = n+1;
        // Find if any options are disabled due to lack of power
        if (trackPower) {  // We have track power
          if (turnoutCount == 0) menuResponse[1] = 200;
          if (routeCount == 0)   menuResponse[2] = 200;
          if (cmdProtocol == WITHROT) {
            menuResponse[4] = 200;
            if (lastMainMenuOption == 4) lastMainMenuOption = 0;
          }
        }
        else {   // We have no track power
          menuResponse[0] = 200;
          if (nvs_get_int("noPwrTurnouts", 0) == 0) menuResponse[1] = 200;
          if (nvs_get_int("noPwrTurnouts", 0) == 0) menuResponse[2] = 200;
          menuResponse[4] = 200;
          if (lastMainMenuOption != 3 && lastMainMenuOption != 5) lastMainMenuOption = 3;
        }
        // check if any menu options are disabled from configuration
        {
          uint8_t chkMask  = 1;
          menuMask = nvs_get_int("mainMenuMask", 0);
          for (uint8_t n=0; n<6; n++, chkMask <<= 1) {
            if ((menuMask & chkMask) > 0 ) menuResponse[n] = 200; // Kill the option
          }
        }
        // Check if the menu is displayable
        menuDisplayable = false;
        for (uint8_t n=0; n<6 && !menuDisplayable; n++) if (menuResponse[n] != 200) menuDisplayable = true;
        if (menuDisplayable) {   // Menu is displayable
          answer = displayMenu ((const char**)baseMenu, menuResponse, 6, lastMainMenuOption);
          if (answer > 0) lastMainMenuOption = answer - 1;
          switch (answer) {
            case 1:
              if (trackPower) mkLocoMenu ();
              else displayTempMessage ((char*)txtWarning, (char*)txtNoPower, true);
              break;
            case 2:
              if (trackPower || nvs_get_int("noPwrTurnouts", 0) == 1) mkTurnoutMenu ();
              else displayTempMessage ((char*)txtWarning, (char*)txtNoPower, true);
              break;
            case 3:
              if (trackPower || nvs_get_int("noPwrTurnouts", 0) == 1) mkRouteMenu();
              else displayTempMessage ((char*)txtWarning, (char*)txtNoPower, true);
              break;
            case 4:
              mkPowerMenu();
              break;
            case 5:
              if (trackPower) mkCVMenu ();
              else displayTempMessage ((char*)txtWarning, (char*)txtNoPower, true);
              break;
            case 6:
              mkConfigMenu();
              break;
          }
        }
        else {     // Menu is not displayable - show info instead, 10 second refresh
          displayInfo();
          delay (10000);
        }
      }
    }
    delay (debounceTime);
  }
  #endif   //  NODISPLAY
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s Terminate loop()\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }   //  stop thread is not required
  vTaskDelete( NULL );
}


// Decode reason for last reser
void print_reset_reason(uint8_t n, RESET_REASON reason)
{
  if (reason>0 && reason<17) {
    Serial.printf ("%s CPU %d reset reason: ", getTimeStamp(), n);
    switch ( reason)
    {
      case 1  : Serial.printf ("Vbat power on reset");break;
      case 3  : Serial.printf ("Software reset digital core");break;
      case 4  : Serial.printf ("Legacy watch dog reset digital core");break;
      case 5  : Serial.printf ("Deep Sleep reset digital core");break;
      case 6  : Serial.printf ("Reset by SLC module, reset digital core");break;
      case 7  : Serial.printf ("Timer Group0 Watch dog reset digital core");break;
      case 8  : Serial.printf ("Timer Group1 Watch dog reset digital core");break;
      case 9  : Serial.printf ("RTC Watch dog Reset digital core");break;
      case 10 : Serial.printf ("Instrusion tested to reset CPU");break;
      case 11 : Serial.printf ("Time Group reset CPU");break;
      case 12 : Serial.printf ("Software reset CPU");break;
      case 13 : Serial.printf ("RTC Watch dog Reset CPU");break;
      case 14 : Serial.printf ("for APP CPU, reset by PRO CPU");break;
      case 15 : Serial.printf ("Reset when the vdd voltage is not stable");break;
      case 16 : Serial.printf ("RTC Watch dog reset digital core and rtc module");break;
      default : Serial.printf ("Unknown - NO_MEAN code");
    }
    Serial.printf ("\r\n");
  }
}
